package com.sjw.version;

public class 기본자료에완성도를높힐려면 {
	/* 
	 * 이 샘플 예제는 Spring jdbc 기술과 Spring MyBatis기술을 결합한
	 * 예제로서 스프링 mvc 위에 바람직한 jdbc처리의 한 모델을 제시한 것입니다.
	 * 완성도는 떨어지는 예제입니다.
	 * 이 예제에 완성도를 높히려면 최소한 다음과 같은 사항이 추가되면 실무용으로
	 * 사용가능 합니다.
	 * 1. 게시자를 회원제로 하기 위해 회원관련 테이블과 연동되는 구조로 바꾸고,
	 * 2. 현재  MYMEMBER에 등록된 회원만이 게시글을 쓸 수 있습니다.
	 * 3. 게시글은 본인만 수정,삭제 가능하도록 해주면 됩니다. 
	 *    즉, 로그인 기능을 추가하고 로그인된 사용자의 글만 수정 삭제가 가능하도록 하면 좋겠습니다.
	 * 4. 본 글을 삭제할 수 있지만, 댓글이 있는 경우에는 댓글이 삭제되어야 
	 *    본글이 삭제되도록하는 기능을 추가하면 좋겠습니다.
	 * 5. 가계부 기능까지 추가하여 완성시키면 좋겠습니다. 
	 * di,aop,tranzaction 부분들을 적절하게 구현 해보면 좋겠습니다.  
	 */
}
